app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(title:params[:article][:title], description:params[:articles][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-07-22 05:15:10.474417"], ["id", 1]]